{"data":{"markdownRemark":{"id":"e8ad080d-2f48-5bb5-aa7b-ae2f902211a8","html":"<p><img src=\"/media/pixabay/gst-revised-invoice.jpg\" alt=\"GST - Revised Tax Invoice\" title=\"GST - Revised Tax Invoice\">\n<a href=\"https://pixabay.com/photos/eraser-abrasion-stationery-office-3822402/\"><center><span style=\"color:black\">Image Source</span></center></a></p>\n<p>If you are a businessman and your business is in India and if your annual turnover is Rs. 20 lakh or more then surely you will have to be registered under GSTN (Goods &#x26; Services Tax Network) to obtain your GSTIN. We all known that from 1st July, 2017 India started the implementation of GST all over the country. But it may happen that you have been applied for your GSTIN but you didn’t get it within 1st July, 2017. Thus the transactions you have made between the effective date of GST and date of issue of GSTIN are done in previous tax rate. At this point you can issue a revised invoice of this transactions to apply the GST rates in them. To be more clear, you will revise the invoices you made between the following dates:</p>\n<p>      <strong>1. Implementation date of GST</strong><br>\n     <strong>2. Date of issue of GSTIN</strong></p>\n<p>Here lies one condition, the revise invoice will have to be issued withing one month from the date of issue of GSTIN.</p>\n<p>If the recipient person is not registered(does not have GSTIN) then you can issue a consolidated revised invoice of all the taxable supply you made to him.\nIn case of inter-state supply if the supply amount does not exceeds two lakh and fifty thousand rupees you can issue a consolidated revised invoice to all to recipient separately who is unregistered during the period.</p>\n<p>If you revise your invoices then the recipient would be allowed to take the credit of tax charged in revised invoice. Thus you customers will be benefited from your revised invoice.</p>\n<p>The revised invoice that you issue will contain the following particulars -</p>\n<ul>\n<li>the word “Revised Invoice”,</li>\n<li>name, address and GSTIN of the supplier,</li>\n<li>nature of the document,</li>\n<li>a consecutive serial number not exceeding sixteen characters, containing alphabets or numerals or special characters -hyphen or dash and slash symbolized as “-” and “/” respectively, unique for a financial year,</li>\n<li>date of issue of the document,</li>\n<li>name, address and GSTIN or UIN, if registered, of the recipient,</li>\n<li>name and address of the recipient and the address of delivery, along with the name of State and its code, if such recipient is not registered,</li>\n<li>serial number and date of the corresponding tax invoice,</li>\n<li>value of taxable supply of goods or services, rate of tax and the amount of the tax, and</li>\n<li>signature or digital signature of the supplier or his authorized representative.</li>\n</ul>\n<p>Click <a href=\"https://www.nahidsaikat.com/category/accounting/\" title=\"Accounting Post\">here</a> for other accounting related post and <a href=\"https://www.nahidsaikat.com/tag/indian-gst/\" title=\"Indian GST\">here</a> for other GST related post.</p>","fields":{"slug":"/blog/2017/08/20/gst-revised-invoice/","tagSlugs":["/tag/financial-accounting/","/tag/indian-gst/"]},"frontmatter":{"date":"2017-08-20T22:12:03.284Z","description":"If you are a businessman and your business is in India and if your annual turnover is Rs. 20 lakh or more then surely you will have to be registered under GSTN (Goods & Services Tax Network) to obtain your GSTIN.","tags":["Financial Accounting","Indian GST"],"title":"GST - Revised Tax Invoice"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/2017/08/20/gst-revised-invoice/"}}