{"data":{"markdownRemark":{"id":"5a4ac7de-146c-58ff-9487-fffcb4095aca","html":"<p><img src=\"/media/pixabay/bank-reconciliation.jpg\" alt=\"Bank Reconciliation\" title=\"Bank Reconciliation\">\n<a href=\"https://pixabay.com/photos/calculator-calculation-insurance-385506/\"><center><span style=\"color:black\">Image Source</span></center></a></p>\n<h3 id=\"what-is-bank-reconciliation\"><a href=\"#what-is-bank-reconciliation\" aria-label=\"what is bank reconciliation permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>What is Bank Reconciliation?</h3>\n<p>A company’s cash account records all the transactions related to cash. Similarly Bank also records all the transactions of its account. The balance of these two account should be equal. But in most cases they don’t match properly. There are some transactions that appear in one but not in other which cause the main reason of mismatched amount. Typically bank sends a statement containing all transactions of its accounts to the company in every month. This statement contains the beginning balance of account, transaction during this month and the ending balance of the account. After getting the statement from bank company should match the transaction with the book account to be consistent. The process of matching bank statement with the company’s book account is called bank reconciliation.</p>\n<h3 id=\"bank-reconciliation-process\"><a href=\"#bank-reconciliation-process\" aria-label=\"bank reconciliation process permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Bank Reconciliation Process</h3>\n<p>Deposit in transit, outstanding checks, service charge, NSF checks, interest earned, notes receivable are the items that causes mismatch in both accounts. These items doesn’t appear in both. Bank reconciliation process ensures that they are present in both account. Bank reconciliation process can be divided on two steps. Adjusting the balance as per bank account and adjusting the balance as per book account.</p>\n<h3 id=\"adjusting-the-balance-per-bank\"><a href=\"#adjusting-the-balance-per-bank\" aria-label=\"adjusting the balance per bank permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Adjusting the Balance per Bank</h3>\n<p><strong>Deposit in transit:</strong> Sometimes company receives payment from customers and records it. But this payment amount is deposited in bank so lately that they don’t appear on current statement but will appear on next bank statement. Suppose company receives payment on 31st January so book account will record it in January transaction. Because of lately deposit bank will record in on 1st February and next bank statement will contain it. As deposit in transits are already in book account it should be added to bank account to show correct balance.</p>\n<p><strong>Outstanding checks:</strong> Outstanding checks are the checks that has been issued by the company but has not been cleared yet. Typically checks issued at the end of month may be cleared at the beginning of next month. But company records it after issuing but bank will record when it is cleared. As outstanding checks are present in book account bank account needs to adjusted for correct balance.</p>\n<p><strong>Errors:</strong> Special care should be taken while recording any transaction. But it can not eliminate errors permanently.  It may happen that a transaction amount is 145 but it is recorded as 154 or vise versa which causes error. Based on the type of error bank account will be added or subtracted of the correct amount for accurate balance.</p>\n<h3 id=\"adjusting-the-balance-per-book\"><a href=\"#adjusting-the-balance-per-book\" aria-label=\"adjusting the balance per book permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Adjusting the Balance per Book</h3>\n<p><strong>Service Charge:</strong> Sometimes bank reduces the balance for service charges. Bank maintains the account, take deposits, clear checks, prepare bank statement and for this kind of activity bank takes charge with out notifying the company. Company know about it after getting bank statement. As bank service charges are absent in book account it should be deducted for correct balance.</p>\n<p><strong>NSF Checks:</strong> NSF stands for ‘Not Sufficient Funds’. When checks are being taken to bank for clearance but bank account has low balance these checks are termed as NSF checks. In case of NSF checks bank takes a charge which is present in bank statement but not in book account. So book account needs to be adjusted.</p>\n<p><strong>Check Printing Charge:</strong> Sometimes bank takes charge for the check that they print for company. After getting the bank statement company know about it and they should reduce book balance for being consistent with bank account.</p>\n<p><strong>Interest Earned:</strong> Company earns interest for the bank account they have. Bank statement contains records of this amount. But company account doesn’t contains it. So after getting the bank statement company book account should be added by interest amount.</p>\n<p><strong>Notes Receivable:</strong>  When company authorizes bank can collect notes receivable and its interest for the company. Bank also charges some amount for this collection service. If bank collects notes receivable company can know about it after having bank statement. So book account needs to be added with notes receivable amount plus interest and also reduced with bank charges.</p>\n<p><strong>Errors:</strong> In the process of recording every transaction errors may happen. When errors are identified book account should be added or subtracted for accurate balance.</p>\n<h3 id=\"conclusion\"><a href=\"#conclusion\" aria-label=\"conclusion permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h3>\n<p>After adjusting both the bank and book accounts, end balance should be compared. If still it does not match then same procedure should be taken until it matches. When book balance matches with bank balance necessary adjusting entry should given to book account. Bank reconciliation process ensures the correctness of the transactions of cash account. So it is very important for every company to reconcile their accounts.</p>\n<p>Check out other accounting related post from\n<a href=\"https://www.nahidsaikat.com/category/accounting/\" title=\"Accounting Post\">here</a>.</p>","fields":{"slug":"/blog/2018/01/21/bank-reconciliation/","tagSlugs":["/tag/financial-accounting/","/tag/banking/"]},"frontmatter":{"date":"2018-01-21T22:12:03.284Z","description":"","tags":["Financial Accounting","Banking"],"title":"Bank Reconciliation"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/2018/01/21/bank-reconciliation/"}}