{"data":{"markdownRemark":{"id":"156c491a-447c-5035-b0c4-ad3c046d6dbc","html":"<p><img src=\"/media/pixabay/gst-refund-voucher.jpg\" alt=\"GST - Refund Voucher\" title=\"GST - Refund Voucher\">\n<a href=\"https://pixabay.com/photos/copy-space-text-box-cardboard-pack-2535266/\"><center><span style=\"color:black\">Image Source</span></center></a></p>\n<p>Generally manufacturers demand advance to delivery a bulk of products. Service providers also asks for an advance payment for completion of a service. When a manufacturer gets paid of an advance amount for an order then at that moment he/she needs to issue a receipt voucher against that advance. But in future if that order gets cancelled then the manufacturer will issue a refund voucher to the person who paid the advance.</p>\n<p>Same case will play for the service providers also. A service provider requires to issue a receipt voucher when he/she gets paid of an advance amount for a service, and also needs to issue a refund voucher if the service order gets cancelled in future.</p>\n<h5 id=\"example\"><a href=\"#example\" aria-label=\"example permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Example:</h5>\n<ol>\n<li>\n<p>Ganga Electronics Ltd. gets an order to supply 50 laptop computer (each laptop is for RS. 40,000) from Summer Info Technologies for their new office. Ganga Electronics Ltd. gets a payment of RS. 5,00,000 in advance. Thus Ganga Electronics Ltd. will issue a receipt voucher to Summer Info Technologies. But after some days Summer Info Technologies cancelled the order for their internal complexities. Now Ganga Electronics Ltd. needs to issue a refund voucher against the cancellation of the order.</p>\n</li>\n<li>\n<p>Harsa Travel Agency gets an order to transport some goods from Mumbai to New Delhi from a company called Rainbow Industries Ltd. The agency gets an advance payment of RS. 30,000. But due to some political violations in New Delhi Rainbow Industries Ltd. has cancelled the order. Now Harsa Travel Agency should issue a receipt voucher at the time of advance payment and a refund voucher at the time of cancellation.</p>\n</li>\n</ol>\n<p>The refund voucher that should be issued will contain the following information -</p>\n<ul>\n<li>Name, address and GSTIN of the supplier.</li>\n<li>A consecutive serial number for refund voucher not exceeding sixteen characters, containing alphabets or numerals or special characters-hyphen or dash and slash, unique for a financial year.</li>\n<li>Date of its issue of refund voucher.</li>\n<li>Name, address and GSTIN of the recipient, if registered under GST. In case the recipient is not registered under GST, then name, address and place of supply.</li>\n<li>Number and date of receipt voucher.</li>\n<li>Description of goods or services in respect of which refund is made.</li>\n<li>The amount of refund made.</li>\n<li>Rate of GST tax charged on the transaction like CGST, SGST, IGST and GST Cess.</li>\n<li>Amount of GST tax paid by the recipient.</li>\n<li>If reverse charge was applicable.</li>\n<li>Signature or digital signature of the supplier or his authorized representative.</li>\n</ul>\n<p>Click <a href=\"https://www.nahidsaikat.com/category/accounting/\" title=\"Accounting Post\">here</a> for other accounting related post and <a href=\"https://www.nahidsaikat.com/tag/indian-gst/\" title=\"Indian GST\">here</a> for other GST related post.</p>","fields":{"slug":"/blog/2017/09/16/gst-refund-voucher/","tagSlugs":["/tag/financial-accounting/","/tag/indian-gst/"]},"frontmatter":{"date":"2017-09-16T22:12:03.284Z","description":"","tags":["Financial Accounting","Indian GST"],"title":"GST - Refund Voucher"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/2017/09/16/gst-refund-voucher/"}}