{"data":{"markdownRemark":{"id":"e3f53b3b-8404-57c8-8cd1-97fcc7969fee","html":"<p><img src=\"/media/pixabay/gst-job-work-process.jpg\" alt=\"GST - Job Work Process\" title=\"GST - Job Work Process\">\n<a href=\"https://pixabay.com/photos/book-robot-cube-simulation-3022615/\"><center><span style=\"color:black\">Image Source</span></center></a></p>\n<p>Job work process is one of the common activities in manufacturing industries. There are several processes like initial process, intermediate process, assembly, packing, final process etc. are being carried out by a manufacturer. There could be a situation when a process carried out by a manufacturer is very costly. That time it could be cost effective to let the process being carried out by another person. In general sense this is named as job work process.</p>\n<p>According to section 2(68) of Indian CGST Act 2017, any process or treatment undertaken by a person on goods belonging to another registered person is called job work. Here the person who performs the process is termed as ‘job worker’ and the owner of the goods is termed as the ‘principal’. One thing to be noted is that the ownership of the goods is not transferred. The job worker is just carried out the process specified by the principal on the goods.</p>\n<h4 id=\"procedure-of-job-work-under-gst\"><a href=\"#procedure-of-job-work-under-gst\" aria-label=\"procedure of job work under gst permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Procedure of job work under GST</h4>\n<ol>\n<li>Goods are send out to the job workers place of business with a challan. It is not important that the goods needs to be send out from the principals place of business. Goods can be directly send out to the job workers place of business from the supplier of the goods of principal.</li>\n<li>The supply date will be count if the goods are supplied from the principals place of business. In case the goods are directly supplied to job worker from the supplier of the goods of principal, the receive date of the goods by job worker will be counted.</li>\n<li>No GST will be applicable if the goods are brought back by the principal within 1 year in case of inputs, semi-finished or finished goods and within 3 years in case of capital goods.</li>\n<li>The principal is permitted to supply the goods to his customers from the place of business of the job worker in between 1 year or 3 years respectively with payment of GST inside India and with or without payment of GST outside India.</li>\n<li>If the goods are not brought back or supplied within 1 year or 3 years respectively then it will be assumed that  the goods are being supplied from the principal to the job worker on the date specified in section B above. In this case principal will pay the GST with interest.</li>\n</ol>\n<p>GST will be applicable on the charge charged by the job worker to the principal and it will be paid by the registered  job worker.</p>\n<p>No GST will be applicable on the moulds and dies, jigs and fixtures or tools sent from principal to job worker.</p>\n<p>If the job worker is not registered then the principal needs to mention the job workers place of business as an additional place of business in his GST registration.</p>\n<p>Section 19 of the CGST Act, 2017 provides that the principal (who send the goods to job worker) shall be entitled to take the credit of  input tax paid on the inputs sent to the job worker for job work.</p>\n<p>Waste or scrap generated in any process can be sold out by the payment of tax by the job worker (if registered) or by principal (if job worker is unregistered).</p>\n<p>The challan issued to the job worker when goods are send out to job workers place of business must contains the following information -</p>\n<ol>\n<li>date and number of the delivery challan</li>\n<li>name, address and GSTIN of the consigner and consignee</li>\n<li>HSN code, description and quantity of goods</li>\n<li>Taxable value, tax rate, tax amount- CGST, SGST, IGST, UTGST separately</li>\n<li>Place of supply and signature</li>\n</ol>\n<p>Click <a href=\"https://www.nahidsaikat.com/category/accounting/\" title=\"Accounting Post\">here</a> for other accounting related post and <a href=\"https://www.nahidsaikat.com/tag/indian-gst/\" title=\"Indian GST\">here</a> for other GST related post.</p>","fields":{"slug":"/blog/2017/08/26/gst-job-work-process/","tagSlugs":["/tag/financial-accounting/","/tag/indian-gst/"]},"frontmatter":{"date":"2017-08-26T22:12:03.284Z","description":"Job work process is one of the common activities in manufacturing industries. There are several processes like initial process, intermediate process, assembly, packing, final process etc. are being carried out by a manufacturer.","tags":["Financial Accounting","Indian GST"],"title":"GST - Job Work Process"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/2017/08/26/gst-job-work-process/"}}